//==========================================
//
//  出た順に押す(minigame_pressorder.cpp)
//  Author : Tomoya Kanazaki
//
//==========================================
#include "precompile.h"
#include "minigame_pressorder.h"
#include "debug_proc.h"

//==========================================
//  静的メンバ変数宣言
//==========================================
CTarget *CMiniGamePressOrder::m_pTarget = NULL;

//==========================================
//  コンストラクタ
//==========================================
CMiniGamePressOrder::CMiniGamePressOrder()
{

}

//==========================================
//  デストラクタ
//==========================================
CMiniGamePressOrder::~CMiniGamePressOrder()
{

}

//==========================================
//  初期化処理
//==========================================
HRESULT CMiniGamePressOrder::Init()
{
	return S_OK;
}

//==========================================
//  終了処理
//==========================================
void CMiniGamePressOrder::Uninit()
{

}

//==========================================
//  更新処理
//==========================================
void CMiniGamePressOrder::Update()
{
	CDebugProc::Print("出た順に押す\n");
}

//==========================================
//  描画処理
//==========================================
void CMiniGamePressOrder::Draw()
{

}

//==========================================
//  読み込み処理
//==========================================
void CMiniGamePressOrder::Load()
{

}

//==========================================
//  破棄
//==========================================
void CMiniGamePressOrder::UnLoad()
{

}
