//==========================================
//
//  出た順に押す(minigame_comeout.cpp)
//  Author : Tomoya Kanazaki
//
//==========================================
#include "minigame_comeout.h"
#include "debug_proc.h"

//==========================================
//  コンストラクタ
//==========================================
CMiniGameComeOut::CMiniGameComeOut()
{

}

//==========================================
//  デストラクタ
//==========================================
CMiniGameComeOut::~CMiniGameComeOut()
{

}

//==========================================
//  初期化処理
//==========================================
HRESULT CMiniGameComeOut::Init()
{
	return S_OK;
}

//==========================================
//  終了処理
//==========================================
void CMiniGameComeOut::Uninit()
{

}

//==========================================
//  更新処理
//==========================================
void CMiniGameComeOut::Update()
{
	CDebugProc::Print("出た順に押すモードだよーーーん\n");
}

//==========================================
//  描画処理
//==========================================
void CMiniGameComeOut::Draw()
{

}
